---
type: TrussMemberInfo
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# TrussMemberInfo

`Autodesk.Revit.DB.Structure.TrussMemberInfo` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TrussMemberInfo | — | `public TrussMemberInfo ()` |
| Property | hostTrussId | — | `public ElementId hostTrussId { get ; set ; }` |
| Property | lockedToTruss | — | `public bool lockedToTruss { get ; set ; }` |
| Property | memberTypeKey | — | `public TrussMemberType memberTypeKey { get ; set ; }` |